// Задача №5. Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.
// 4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4" 
// 2 -> " -2, -1, 0, 1, 2"

// Console.Write("Введите число: ");
// int num = Convert.ToInt32(Console.ReadLine());
// int start = -num;

// while (start != num+1)
//     {
//         System.Console.Write(start+" ");
//         start++;
//     }


// Задача №7. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
// 	456 -> 6
// 	782 -> 2
// 	918 -> 8

// System.Console.WriteLine("введите какое-нибудь целое трехзначное число");
// int num = Convert.ToInt32 (Console.ReadLine());

// System.Console.WriteLine(num%10);